# UserControlledInverses Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileModelOptions..::..UserControlledInverses Property
IFCFileModelOptions Class See Also
---
Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool UserControlledInverses { get; set; }
```

Visual Basic
---
```text
Public Property UserControlledInverses As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UserControlledInverses {
	bool get ();
	void set (bool value);
}
```

# See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace